#while-ը ցիկլ է, որը կատարում է կոդի որոշակի մասը, քանի դեռ պայմանը ճիշտ է։

counter = 0
while counter < 10:
    print(f'Հաշվիչը հավասար է {counter}')
    counter += 1

print('Ցիկլը ավարտվեց։')

#Գոյություն ունի անվերջ ցիկլ

#Այստեղ եթե մենք exit-ի փոխարեն ուրիշ բան մուտքագրենք, ապա ցիկլը կշարունակվի։
while True:
    user_input = input("Մուտքագրեք exit հրամանը դուրս գալու համար: ")
    
    # Դուրս գալու պայման
    if user_input == "exit":
        print("Ծրագիրը ավարտվեց։")
        break  # break-ը միանգամից ավարտում է ցիկլը
        
    print(f"Օգտագործվեց {user_input} հրամանը։")

